#字典是一系列键和值的相对应，每个键都和一个值相关联，可以通过键访问值
#值可以是数字、字符串、列表 、字典。

                ###__示例（一）
# 一周活动安排 = {'周一':'上课','周二':'打游戏','周三':3}
# 今天去干嘛 = 一周活动安排['周二']
# print("你今天应该去"+str(今天去干嘛))

                ###__示例（二）  将花括号回车再填写键值，便于浏览。
# 一周活动安排 = {
#     '周一' : '上课',
#     '周二' : '打游戏',
#     '周三' : '3'
# }
# 今天去干嘛 = 一周活动安排['周二']
# print("你今天应该去"+str(今天去干嘛))

                ###__创建空字典（增添方便）
# 食谱 = {}
# 食谱['鸡蛋羹'] = 'egg'
# 食谱['土豆泥'] = '土豆'
# 食谱['红烧鸡块'] = '鸡肉'
# print(食谱)

                ###__修改字典中的值
# 食谱 = {}
# 食谱['鸡蛋羹'] = 'egg'
# 食谱['土豆泥'] = '土豆'
# 食谱['红烧鸡块'] = '鸡肉'
# print(食谱)
# 食谱['鸡蛋羹'] = '鸡蛋'
# print(食谱)

                ### __增加键和值
# 食谱 = {}
# 食谱['鸡蛋羹'] = 'egg'
# 食谱['土豆泥'] = '土豆'
# 食谱['红烧鸡块'] = '鸡肉'
# print(食谱)
# 食谱['酸菜鱼'] = '鱼'
# print(食谱)

                ###__删除键值（del语句）
# 食谱 = {}
# 食谱['鸡蛋羹'] = 'egg'
# 食谱['土豆泥'] = '土豆'
# 食谱['红烧鸡块'] = '鸡肉'
# print(食谱)
# del 食谱['鸡蛋羹']
# print(食谱)

                ###__遍历（浏览）字典   for循环遍历与 items  keys  values 用法
# 食谱 = {}
# 食谱['鸡蛋羹'] = 'egg'
# 食谱['土豆泥'] = '土豆'
# 食谱['红烧鸡块'] = '鸡肉'
# print(食谱)
# #遍历键和值
# for key, value in 食谱.items():    #key和value可替换成其他字符，重要的是与之相对应
#     print("\n食物是"+ key)
#     print("食材是"+ value)
# ##遍历值，if与if not 用法
# for 食物 in 食谱.keys():
#     print(食物)
# if '鸡蛋羹' in 食谱.keys():          #键是唯一的需要调用
#     print('我们今天吃鸡蛋羹吧！')
# print("_____分割线______")
# for 食材 in 食谱.values():
#     print(食材)
# if '猪肉' not  in 食材:
#     print('今天吃不上猪肉了')

                ###__遍历字典进行排序和剔除重复
# china = {
#     'a':'anhui',
#     's':'shanghai',
#     'b':'beijing',
#     'x':'xian',
#     'A':'anhui'
# }
# for name in sorted(china.keys()):
#     print(name + "重新排序了")
# for name1 in set(china.values()):
#     print(name1 + "去除重复了")

                ###__嵌套     列表嵌套字典，字典嵌套列表，字典嵌套字典
##列表嵌套字典
# zidian1 = {'安徽':'合肥'}
# zidian2 = {'湖北':'武汉'}
# zidian3 = {'四川':'重庆'}
# libiao = [zidian1,zidian2,zidian3]
# for x in libiao:
#     print(x)

##循环字典修改字典参数
# china = []
# for y in range(5):
#     zidian = {'安徽':'合肥','首都':'北京','年份':2022}
#     china.append(zidian)
# for z in china[0:2]:
#     if z['安徽'] == '合肥':
#         z['安徽'] = '亳州'
#         z['年份'] = 2345
#     print(z)
# print(china)

##字典嵌套列表
# china = {
#     '首都':'北京',
#     '省份':['安徽','湖南','湖北','广东'],
#     '直辖市':['上海','深圳','重庆']
# }
# print("中国的首都是"+china['首都'])
# for i in china['省份']:
#     print('中国的省会含有'+'\t'+ i)

##字典嵌套字典
china = {
    '安徽': {
        '省会':'合肥',
        '地级市':['阜阳','亳州','黄山']
    },
    '湖南':{
        '省会':'长沙',
        '地级市':['张家界','绥德']
    }
}
for k , v in china.items():
    print("中国的省有"+ k)
    w = v['省会']
    print("中国省会有"+w)
    for i in v['地级市']:
        print(i)



